[
    {
        "bookId": "001",
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/4MTwn1z/494-4946009-picture-kill-a-mockingbird-first-edition-cover-hd-removebg-preview.png",
        "review": "To Kill a Mockingbird by Harper Lee is a masterpiece that delves deep into the racial tensions of the American South. Set in the 1930s, it follows the trial of a black man falsely accused of raping a white woman, through the eyes of young Scout Finch. The novel explores themes of morality, justice, and empathy, as well as the loss of innocence. Harper Lee's compelling narrative and well-drawn characters make this book a timeless classic, offering profound insights into human nature and societal prejudice.",
        "totalPages": 324,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["classics", "race", "law"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1960,
        "color": "#FF5733"
    },
    {
        "bookId": "002",
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/Y2v37TN/1984-George-Orwell-Buy-Online-Bookbins-1-removebg-preview.png",
        "review": "George Orwell's 1984 is a chilling portrayal of a dystopian future where totalitarianism reigns supreme. Set in a world of constant surveillance and propaganda, it follows the life of Winston Smith, a man who rebels against the oppressive regime of Big Brother. Orwell's vision of a society stripped of individuality and freedom is both haunting and thought-provoking. Through vivid imagery and stark prose, 1984 warns against the dangers of unchecked government power and serves as a stark reminder of the importance of freedom and truth.",
        "totalPages": 328,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["dystopian", "totalitarianism", "surveillance"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949,
        "color": "#FFC300"
    },
    {
        "bookId": "003",
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/GHVfVgD/Screen-Shot-2020-05-08-at-6-21-25-PM-removebg-preview.png",
        "review": "F. Scott Fitzgerald's The Great Gatsby is a timeless classic that offers a vivid portrayal of the Jazz Age and the American Dream. Set in the roaring 1920s, it follows the enigmatic Jay Gatsby and his pursuit of wealth and love. Through the eyes of narrator Nick Carraway, the reader is drawn into a world of lavish parties, secret affairs, and societal decadence. Fitzgerald's lyrical prose and keen observations of human nature make this novel a poignant exploration of the emptiness that lies beneath the facade of the American Dream.",
        "totalPages": 180,
        "rating": 4.3,
        "category": "Fiction",
        "tags": ["wealth", "love", "American Dream"],
        "publisher": "Scribner",
        "yearOfPublishing": 1925,
        "color": "#C70039"
    },
    {
        "bookId": "004",
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/LQLwD3Q/png-clipart-publishing-literature-book-the-catcher-in-the-rye-hachette-livre-unsolved-celebrity-deat.png",
        "review": "J.D. Salinger's The Catcher in the Rye is a seminal work of American literature that captures the angst and alienation of adolescence. Narrated by the disillusioned teenager Holden Caulfield, the novel follows his journey through New York City after being expelled from prep school. Through Holden's cynical observations and existential crisis, Salinger explores themes of identity, belonging, and the search for authenticity. The Catcher in the Rye remains a poignant and relevant coming-of-age story that resonates with readers of all generations.",
        "totalPages": 224,
        "rating": 4.2,
        "category": "Fiction",
        "tags": ["coming-of-age", "teenage", "rebellion"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951,
        "color": "#900C3F"
    },
    {
        "bookId": "005",
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/HxRPCH8/png-clipart-pride-and-prejudice-the-story-grid-edition-brand-font-cover-book-text-brand-removebg-pre.png",
        "review": "Jane Austen's Pride and Prejudice is a timeless romantic comedy of manners that continues to captivate readers with its wit and charm. Set in early 19th-century England, it follows the spirited Elizabeth Bennet as she navigates the complexities of love and social class. Through Austen's sharp social commentary and memorable characters, the novel explores themes of marriage, reputation, and the importance of self-awareness. Pride and Prejudice remains a beloved classic that celebrates the triumph of love over societal expectations.",
        "totalPages": 279,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["romance", "social class", "family"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813,
        "color": "#DAF7A6"
    },
    {
        "bookId": "006",
        "bookName": "Moby-Dick",
        "author": "Herman Melville",
        "image": "https://i.ibb.co/brM0YHq/mby1-removebg-preview.png",
        "review": "Herman Melville's Moby-Dick is a monumental work of American literature that explores the themes of obsession, revenge, and the power of nature. Set against the backdrop of the 19th-century whaling industry, it follows the sailor Ishmael as he joins the obsessive Captain Ahab on his quest to hunt down the elusive white whale, Moby Dick. Through its rich symbolism and philosophical musings, Moby-Dick delves into the depths of human nature and the eternal struggle between man and the unknown. Melville's magnum opus continues to enthrall readers with its epic scope and timeless relevance.",
        "totalPages": 544,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["obsession", "revenge", "sea adventure"],
        "publisher": "Richard Bentley (UK), Harper & Brothers (US)",
        "yearOfPublishing": 1851,
        "color": "#581845"
    },
    {
        "bookId": "007",
        "bookName": "Frankenstein",
        "author": "Mary Shelley",
        "image": "https://i.ibb.co/0sPwZ4x/frankenstein-mestres-do-terror-edgar-allan-poe-medo-classico-book-h-p-lovecraft-medo-classico-v-1-my.png",
        "review": "Frankenstein is an old classic about a scientist who creates a monster and the awful events he unintentionally causes. Victor Frankenstein is a hard-working young man at university who discovers how to give life to an inanimate body and uses his knowledge to create a man-monster. He believes his discovery will lead to further scientific advances but when he succeeds in bringing his creation to life he is filled with loathing.",
        "totalPages": 280,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["science fiction", "horror", "morality"],
        "publisher": "Lackington, Hughes, Harding, Mavor & Jones",
        "yearOfPublishing": 1818,
        "color": "#FFC0CB"
    },
    {
        "bookId": "008",
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/NWqtg8W/the-hobbit-jrr-tolkien-first-edition-1937-rare-removebg-preview.png",
        "review": "This book has got to be one of the greatest books I have ever read. While the Lord of the Rings was targeted at a much older audience, I think that The Hobbit appeals more to younger people because it is less complicated and a whole lot shorter. The Hobbit is based on events that took place before the Lord of the Rings trilogy begins – before the ring was discovered essentially - but it has no less adventure. J.R.R. Tolkein delivers yet again!",
        "totalPages": 310,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["fantasy", "adventure", "Middle-earth"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937,
        "color": "#FF5733"
    },
    {
        "bookId": "009",
        "bookName": "Brave New World",
        "author": "Aldous Huxley",
        "image": "https://i.ibb.co/nLQ05v6/brave-new-world-aldous-huxley-first-edition-rare-signed-removebg-preview.png",
        "review": "Since classic novels are typically taught in school I think a lot of people have the misconception that they’re going to be dry, dull or that no one in a million years would want to spend their free time reading them. After I left school I said the same thing. I have a whole host of opinions on how the education system doesn’t promote reading, but that’s for another day. However, they do need to be given their due. Classic novels can be great reads. I’ve even gone back to books that I read and hated at school and I enjoyed them. I wish they were given more of a chance, and if I were to suggest you pick up any, Brave New World is a great one to start with!",
        "totalPages": 288,
        "rating": 4.1,
        "category": "Fiction",
        "tags": ["dystopian", "society", "conformity"],
        "publisher": "Chatto & Windus",
        "yearOfPublishing": 1932,
        "color": "#FFE082"
    }
]